In [1]:
import numpy as np
import pandas as pd
from datetime import date
from env import get_db_url
from pydataset import data

url = get_db_url('employees')

# Exercises I

## 1 - 4: I have installed pymysql, added env.py to the .gitignore file, created the get_db_url function, and used it to gain access to the 'employees' database.

In [2]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

## 5. Once you have successfully run a query:

### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [3]:
#url = get_db_url('employes')

#pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

#You get an error that says "(1044, "Access denied for user '*user_name*''@'%' to database 'employes'")"

### b. Intentionally make an error in your SQL query. What does the error message look like?

In [4]:
#pd.read_sql('SELECT * FROM employees LIMT 5 OFFSET 50', url)

#ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '5 OFFSET 50' at line 1")

## 6. Read the employees and titles tables into two separate DataFrames.

In [5]:
# Employees:

df_employees = pd.read_sql('SELECT * FROM employees.employees', url)

df_employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [6]:
#Titles:
df_titles = pd.read_sql('SELECT * FROM employees.titles', url)

df_titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [7]:
df_employees.shape

(300024, 6)

In [8]:
df_titles.shape

(443308, 4)

### 8. Display the summary statistics for each DataFrame.

In [9]:
#Describing Employees Table:
df_employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [10]:
#Describing Titles Table:
df_titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

### 9. How many unique titles are in the titles DataFrame?

In [11]:
#Using a SQL query in this field to show a classmate that we can *technically* use pandas to pass a SQL query, but it's often faster to save the table to a dataframe and then use pandas to run analysis on that dataframe.

pd.read_sql('SELECT DISTINCT title from titles', url)

                title
0     Senior Engineer
1               Staff
2            Engineer
3        Senior Staff
4  Assistant Engineer
5    Technique Leader
6             Manager

In [12]:
df_titles.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

### 10. What is the oldest date in the to_date column?

In [13]:
df_titles.to_date.min()

datetime.date(1985, 3, 1)

### 11. What is the most recent date in the to_date column?

In [14]:
df_titles.to_date.max()

datetime.date(9999, 1, 1)

In [15]:
#I'm not sure that this is correct. The questions is for most recent, but do I need to exclude the dates that haven't happened yet. 

df_titles[df_titles.to_date < date.today()].to_date.max()

datetime.date(2002, 8, 1)

# Exercises II

- I need to go through and work these. The below are Ravinder's solutions

### 1. Copy the users and roles DataFrames from the examples above.

In [16]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [17]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

### 2. What is the result of using a right join on the DataFrames?

In [18]:
right_join = users.merge(roles,
                        left_on = 'role_id',
                        right_on = 'id',
                        how = 'right', 
                        indicator = True)

right_join

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

### 3. What is the result of using an outer join on the DataFrames?

In [19]:
outer_join = users.merge(roles,
                       left_on = 'role_id', 
                       right_on = 'id', 
                       how = 'outer', 
                       indicator = True)

outer_join

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [20]:
#Drop the foreign keys from the tables.

users = users.drop(columns = ['id'])
roles = roles.drop(columns = ['id'])

right_join = users.merge(roles,
                        left_on = 'role_id',
                        right_on = 'id',
                        how = 'right', 
                        indicator = True)

right_join

#Without the foreign keys, there is no way to link the tables, so you get a key error when you try.

KeyError: 'id'

### 5. Load the mpg dataset from PyDataset.

In [ ]:
mpg = data('mpg')

### 6. Output and read the documentation for the mpg dataset.

In [ ]:
pydataset.data('mpg', show_doc = True)

### 7. How many rows and columns are in the dataset?

In [ ]:
mpg.shape

#234 rows and 11 columns

### 8. Check out your column names and perform any cleanup you may want on them.

In [ ]:
#You can use '.tolist()' to convert the output into a formatted list.
mpg.columns.tolist()

In [ ]:
#Once you have your formatted list, you can then paste that into the process to rename the columns, and change the names as needed.

mpg.columns = ['manufacturer',
 'model',
 'displacement',
 'year',
 'cylinders',
 'transmission',
 'drive_type',
 'city',
 'highway',
 'fl',
 'class']

### 9. Display the summary statistics for the dataset.

In [ ]:
mpg.describe()

### 10. How many different manufacturers are there?

In [ ]:
#You can use the '.nunique()' function to count the unique values in the column

mpg.manufacturer.nunique()

### 11. How many different models are there?

In [ ]:
mpg.model.nunique()

### 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [ ]:
mpg['mileage_difference'] = mpg.highway - mpg.city

mpg.head()

### 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [ ]:
mpg['average_mileage'] = (mpg.highway + mpg.city) / 2

mpg.head()

### 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [ ]:
#Check the values in the 'transmission' column to see what I'm working with.

mpg.transmission.unique()

In [ ]:
#create a new column called 'is_automatic'

mpg['is_automatic'] = mpg.transmission.str.contains('auto')

mpg.head()

### 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [ ]:
#Here we can use a groupby and aggregation to sort the values.

mpg.groupby['manufacturer'].average_mileage.mean().sort_values(ascending = False)

### 16. Do automatic or manual cars have better miles per gallon?

In [ ]:
#create a new column transmission_category using np.where

mpg['transmission_category'] = np.where[mpg.transmisison.str.contains('auto'), 'automatic', 'manual']

mpg.groupby['transmission_category'].average_mileage.mean().sort_vales(ascending = False)

mpg.groupby('transmission_category')[['average_mileage']].mean().round(1)

# Exercises III

### 1. Use your get_db_url function to help you explore the data from the chipotle database.

In [ ]:
url = get_db_url('chipotle')

chipotle = pd.read_sql('SELECT * FROM orders', url)

chipotle

chipotle['item_price'] = chipotle.item_price.str.replace('$', '').astype(float)

chipotle

### 2. What is the total price for each order?

In [ ]:
chipotle_orders = chipotle.groupby('order_id').item_price.sum()

chipotle_orders

### 3. What are the most popular 3 items?

In [ ]:
most_popular = chipotle[['item_name', 'quantity']].groupby('item_name').count().sort_values(by = 'quantity', ascending = False).head(3)

most_popular

### 4. Which item has produced the most revenue?

In [ ]:
most_revenue = chipotle[['item_name', 'item_price']].groupby('item_name').item_price.sum().sort_values(ascending = False).head(1)

most_revenue

### 5. Join the employees and titles DataFrames together.

In [22]:
employees_and_titles = df_employees.merge(df_titles,
                        left_on = 'emp_no',
                        right_on = 'emp_no',
                        how = 'right', 
                        indicator = True)

In [23]:
#Side tangent with Ryan that will make little sense to anyone but me, but I still want to keep this for reference:
pd.read_sql('SELECT DISTINCT TABLE_SCHEMA FROM information_schema.tables',url)

          TABLE_SCHEMA
0   information_schema
1            albums_db
2             chipotle
3               elo_db
4            employees
5            fruits_db
6          home_credit
7              iris_db
8      join_example_db
9       mall_customers
10             numbers
11           quotes_db
12              sakila
13              svi_db
14         telco_churn
15          titanic_db
16     tsa_item_demand
17               world
18              zillow
19               mysql
20     curriculum_logs
21          grocery_db
22             spam_db
23                logs
24       superstore_db
25               pizza
26            saas_llc
27           tidy_data
28      farmers_market

In [ ]:
df_employees

In [ ]:
df_titles

### 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [31]:
employees_and_titles[['title', 'hire_date']].groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

### 7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)